[
  {
    "quote": "Mistakes are proof that you are trying.",
    "lesson": "Failure is part of learning. Keep going."
  },
  {
    "quote": "Doubt kills more dreams than failure ever will.",
    "lesson": "Believing in yourself is the first step to success."
  },
  {
    "quote": "Do what makes your soul shine.",
    "lesson": "Follow your passions and do what makes you truly happy."
  },
  {
    "quote": "Be stronger than your excuses.",
    "lesson": "Don’t let excuses stop you from achieving your goals."
  },
  {
    "quote": "A positive attitude gives you power over your circumstances.",
    "lesson": "Your mindset can change your reality."
  },
  {
    "quote": "Don’t wait for everything to be perfect before you enjoy your life.",
    "lesson": "Happiness comes from appreciating life as it is, not waiting for perfect conditions."
  },
  {
    "quote": "The problem is not the problem. The problem is your attitude about the problem.",
    "lesson": "Your mindset determines how you handle challenges. Stay positive and find a solution."
  },
  {
    "quote": "Not all treasure is silver and gold, mate.",
    "lesson": "True wealth isn’t just money—it’s experiences, relationships, and freedom."
  },
  {
    "quote": "Why fight when you can negotiate?",
    "lesson": "Violence isn’t always the answer. A smart mind can solve problems better."
  },
  {
    "quote": "You can always trust the dishonest man to be dishonest. Honestly, it's the honest ones you want to watch out for.",
    "lesson": "People are predictable in their nature. Be aware of who you trust."
  },
  {
    "quote": "Crazy people don’t know they’re crazy. I know I am crazy, therefore I’m not crazy, isn’t that crazy?",
    "lesson": "Self-awareness is important. Knowing yourself gives you an advantage."
  },
  {
    "quote": "If you were waiting for the opportune moment, that was it.",
    "lesson": "Don’t hesitate too much—opportunities don’t last forever."
  },
  {
    "quote": "The world is still the same. There’s just less in it.",
    "lesson": "Life changes, but the world keeps moving. Adapt and keep going."
  },
  {
    "quote": "Better to not know which moment may be your last. Every morsel of your entire being is alive to the infinite mystery of it all.",
    "lesson": "Live in the moment. Don’t fear the unknown—embrace it."
  },
  {
    "quote": "Close your eyes and pretend it’s all a bad dream. That’s how I get by.",
    "lesson": "Sometimes, moving forward means letting go of the past."
  },
  {
    "quote": "This is the day you will always remember as the day you almost caught Captain Jack Sparrow!",
    "lesson": "Confidence and quick thinking can help you escape tough situations."
  },
  {
    "quote": "I regret nothing, ever.",
    "lesson": "Learn from your past, but don’t dwell on regrets."
  },
  {
    "quote": "You may kill me, but you may never insult me!",
    "lesson": "Self-respect is more important than anything else."
  },
  {
    "quote": "It’s remarkable how often those two traits coincide: bad luck and stupidity.",
    "lesson": "Make smart choices—luck alone won’t save you."
  },
  {
    "quote": "I’m Captain Jack Sparrow, savvy?",
    "lesson": "Believe in yourself. Confidence makes a difference."
  },
    {
      "quote": "Hope is a good thing, maybe the best of things, and no good thing ever dies.",
      "lesson": "Never lose hope, no matter how dark things get. Hope gives you the strength to keep moving forward."
    },
    {
      "quote": "Get busy living or get busy dying.",
      "lesson": "Life is about choices. You can either take charge and make the most of your time or let it slip away."
    },
    {
      "quote": "Fear can hold you prisoner. Hope can set you free.",
      "lesson": "Fear limits you, but hope gives you the freedom to dream and act."
    },
    {
      "quote": "Some birds aren’t meant to be caged. Their feathers are just too bright.",
      "lesson": "People with true potential and spirit can’t be held back forever. Eventually, they’ll break free."
    },
    {
      "quote": "Salvation lies within.",
      "lesson": "True strength and freedom come from within. No matter your circumstances, your mindset can set you free."
    },
    {
      "quote": "Your mind is a powerful thing. When you fill it with positive thoughts, your life will start to change.",
      "lesson": "A positive mindset can transform your life. What you focus on grows, so choose positivity."
    },
    {
      "quote": "Whether you think you can or think you can’t, you’re right.",
      "lesson": "Your beliefs shape your reality. Confidence and self-belief pave the path to success."
    },
    {
      "quote": "Do one thing every day that scares you.",
      "lesson": "Pushing past fear daily helps you grow stronger, more resilient, and braver over time."
    },
    {
      "quote": "Courage is not the absence of fear, but the triumph over it.",
      "lesson": "Being brave doesn’t mean you’re never afraid — it means taking action despite the fear."
    },
    {
      "quote": "The only thing standing between you and your goal is the story you keep telling yourself as to why you can’t achieve it.",
      "lesson": "Limitations are often self-imposed. Rewrite your inner narrative and chase your dreams."
    },
    {
      "quote": "Everything you’ve ever wanted is on the other side of fear.",
      "lesson": "Conquering fear unlocks new opportunities and experiences. Don’t let it hold you back."
    },
    {
      "quote": "A ship is safe in harbor, but that’s not what ships are built for.",
      "lesson": "Comfort zones keep you safe, but growth lies in venturing into the unknown."
    },
    {
      "quote": "Fear of the unknown can be a prison more confining than any walls.",
      "lesson": "Brooks chose death over a life ruled by fear. Don’t let fear decide your fate — embrace the unknown and find meaning beyond it."
    },
    {
      "quote": "It comes down to a simple choice, really. Get busy living or get busy dying.",
      "lesson": "In life, you have two choices: accept things as they are or fight for something better. Hope gives you the courage to choose the latter."
    },
    {
      "quote": "No good thing ever came from staying comfortable.",
      "lesson": "Growth happens when you step out of your comfort zone and face challenges."
    },
    {
      "quote": "The only way out is through.",
      "lesson": "You can’t escape your problems. Face them head-on and grow stronger."
    },
    {
      "quote": "A little progress each day adds up to big results.",
      "lesson": "Small steps taken consistently lead to big changes over time."
    },
    {
      "quote": "What consumes your mind, controls your life.",
      "lesson": "Focus on positive thoughts. Your mindset shapes your reality."
    },
    {
      "quote": "It’s okay to be scared. Being scared means you’re about to do something brave.",
      "lesson": "Fear isn’t a stop sign. It’s a signal that you’re stepping into growth."
    },
    {
      "quote": "Every storm runs out of rain.",
      "lesson": "Tough times don’t last forever. Stay strong — brighter days will come."
    },
    {
      "quote": "Success is not final, failure is not fatal: it is the courage to continue that counts.",
      "lesson": "Keep going, whether you win or lose. Success is a journey, not a destination."
    },
    {
      "quote": "Happiness is not something ready-made. It comes from your own actions.",
      "lesson": "You create your own happiness by the way you think and act."
    },
    {
      "quote": "Do what you can, with what you have, where you are.",
      "lesson": "You don’t need perfect conditions to start. Just take action now."
    },
    {
      "quote": "Difficulties in life are intended to make us better, not bitter.",
      "lesson": "Challenges help you grow stronger instead of bringing you down."
    },
    {
      "quote": "You are never too old to set another goal or to dream a new dream.",
      "lesson": "Age doesn’t limit you. Keep dreaming and working towards new goals."
    },
    {
      "quote": "Opportunities don’t happen, you create them.",
      "lesson": "Take action and make things happen instead of waiting for chances."
    },
    {
      "quote": "The secret of getting ahead is getting started.",
      "lesson": "Stop overthinking and take the first step. Progress begins with action."
    },
    {
      "quote": "Don’t let yesterday take up too much of today.",
      "lesson": "Learn from the past but don’t dwell on it. Focus on the present."
    },
    {
      "quote": "Success is getting what you want. Happiness is wanting what you get.",
      "lesson": "Appreciate what you have while working for what you want."
    },
    {
      "quote": "Small steps in the right direction can turn out to be the biggest step of your life.",
      "lesson": "Even tiny progress adds up. Keep moving forward."
    },
    {
      "quote": "Stay away from negative people. They have a problem for every solution.",
      "lesson": "Surround yourself with positive, supportive people."
    },
    {
      "quote": "Don’t be pushed by your problems. Be led by your dreams.",
      "lesson": "Let your dreams and goals guide you, not your worries."
    },
    {
      "quote": "If opportunity doesn’t knock, build a door.",
      "lesson": "Create your own chances instead of waiting for them."
    },
    {
      "quote": "You don’t have to be great to start, but you have to start to be great.",
      "lesson": "Every expert was once a beginner. Just begin!"
    }
  ]
  